Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM2532LS00064.atdf
        <register name="USER_WORD_2" offset="0x8" rw="RW" size="4" initval="0xF03007FF" caption="USER Page Word 2">
          <bitfield name="IDAU_AS" caption="Application Secure" mask="0x7FF"/>
          <bitfield name="IDAU_ANSC" caption="Application Non-Secure Callable" mask="0xFF800"/>
          <bitfield name="IDAU_DS" caption="Data Secure" mask="0x1FC00000"/>
        </register>
        <register name="USER_WORD_3" offset="0xC" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 3">
          <bitfield name="IDAU_RS" caption="RAM Secure" mask="0x1FF"/>
          <bitfield name="NVMCTRL_URWEN" caption="User Row Write Enable" mask="0x400"/>
        </register>
        <register name="USER_WORD_4" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 4">
          <bitfield name="NONSECA_PAC" caption="PAC Non-Secure" mask="0x1"/>
          <bitfield name="NONSECA_PM" caption="PM Non-Secure" mask="0x2"/>
          <bitfield name="NONSECA_MCLK" caption="MCLK Non-Secure" mask="0x4"/>
          <bitfield name="NONSECA_RSTC" caption="RSTC Non-Secure" mask="0x8"/>
          <bitfield name="NONSECA_OSCCTRL" caption="OSCCTRL Non-Secure" mask="0x10"/>
          <bitfield name="NONSECA_OSC32KCTRL" caption="OSC32KCTRL Non-Secure" mask="0x20"/>
          <bitfield name="NONSECA_SUPC" caption="SUPC Non-Secure" mask="0x40"/>
          <bitfield name="NONSECA_GCLK" caption="GCLK Non-Secure" mask="0x80"/>
          <bitfield name="NONSECA_WDT" caption="WDT Non-Secure" mask="0x100"/>
          <bitfield name="NONSECA_RTC" caption="RTC Non-Secure" mask="0x200"/>
          <bitfield name="NONSECA_EIC" caption="EIC Non-Secure" mask="0x400"/>
          <bitfield name="NONSECA_FREQM" caption="FREQM Non-Secure" mask="0x800"/>
          <bitfield name="NONSECA_PORT" caption="PORT Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECA_AC" caption="AC Non-Secure" mask="0x2000"/>
        </register>
        <register name="USER_WORD_5" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 5">
          <bitfield name="NONSECB_IDAU" caption="IDAU Non-Secure" mask="0x1"/>
          <bitfield name="NONSECB_DSU" caption="DSU Non-Secure" mask="0x2"/>
          <bitfield name="NONSECB_NVMCTRL" caption="NVMCTRL Non-Secure" mask="0x4"/>
          <bitfield name="NONSECB_DMAC" caption="DMAC Non-Secure" mask="0x8"/>
          <bitfield name="NONSECB_USB" caption="USB Non-Secure" mask="0x20"/>
        </register>
        <register name="USER_WORD_6" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 6">
          <bitfield name="NONSECC_EVSYS" caption="EVSYS Non-Secure" mask="0x1"/>
          <bitfield name="NONSECC_SERCOM0" caption="SERCOM0 Non-Secure" mask="0x2"/>
          <bitfield name="NONSECC_SERCOM1" caption="SERCOM1 Non-Secure" mask="0x4"/>
          <bitfield name="NONSECC_SERCOM2" caption="SERCOM2 Non-Secure" mask="0x8"/>
          <bitfield name="NONSECC_SERCOM3" caption="SERCOM3 Non-Secure" mask="0x10"/>
          <bitfield name="NONSECC_SERCOM4" caption="SERCOM4 Non-Secure" mask="0x20"/>
          <bitfield name="NONSECC_SERCOM5" caption="SERCOM5 Non-Secure" mask="0x40"/>
          <bitfield name="NONSECC_TC0" caption="TC0 Non-Secure" mask="0x80"/>
          <bitfield name="NONSECC_TC1" caption="TC1 Non-Secure" mask="0x100"/>
          <bitfield name="NONSECC_TC2" caption="TC2 Non-Secure" mask="0x200"/>
          <bitfield name="NONSECC_TCC0" caption="TCC0 Non-Secure" mask="0x400"/>
          <bitfield name="NONSECC_TCC1" caption="TCC1 Non-Secure" mask="0x800"/>
          <bitfield name="NONSECC_TCC2" caption="TCC2 Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECC_TCC3" caption="TCC3 Non-Secure" mask="0x2000"/>
          <bitfield name="NONSECC_ADC" caption="ADC Non-Secure" mask="0x4000"/>
          <bitfield name="NONSECC_DAC" caption="DAC Non-Secure" mask="0x8000"/>
          <bitfield name="NONSECC_PTC" caption="PTC Non-Secure" mask="0x10000"/>
          <bitfield name="NONSECC_TRNG" caption="TRNG Non-Secure" mask="0x20000"/>
          <bitfield name="NONSECC_CCL" caption="CCL Non-Secure" mask="0x40000"/>
          <bitfield name="NONSECC_I2S" caption="I2S Non-Secure" mask="0x80000"/>
          <bitfield name="NONSECC_OPAMP" caption="OPAMP Non-Secure" mask="0x100000"/>
          <bitfield name="NONSECC_TRAM" caption="TRAM Non-Secure" mask="0x200000"/>
        </register>
        <register name="USER_WORD_7" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 7">
          <bitfield name="BOOTROM_CDIROFFSET" caption="Location of CDI value when DICE is programmed" mask="0xFFFFFFFF"/>
        </register>
        <register name="USER_WORD_8" offset="0x20" rw="RW" size="4" initval="0xE87673B6" caption="USER Page Word 8">
          <bitfield name="BOOTROM_USERCRC" caption="CRC for USER[1,2,3] DWORDS" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="OPAMP" id="U2237" version="2.0.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
        <register name="OPAMPCTRL0" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="OPAMP0 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18" values="OPAMP_OPAMPCTRL__BIAS"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL0__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL0__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
        <register name="OPAMPCTRL1" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="OPAMP1 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL1__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL1__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
