Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM2532LS00064.atdf
        <register modes="I2CS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="SYSOP" caption="System Operation Synchronization Busy" mask="0x4"/>
          <bitfield name="LENGTH" caption="Length Synchronization Busy" mask="0x10"/>
        </register>
        <register modes="SPIM" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIM Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
        </register>
        <register modes="SPIS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
        </register>
        <register modes="USART_EXT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_EXT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
        </register>
        <register modes="USART_INT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_INT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
        </register>
        <register modes="USART_EXT" name="RXERRCNT" offset="0x20" rw="R" access="RSYNC" size="1" initval="0x00" caption="USART_EXT Receive Error Count">
          <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
        </register>
        <register modes="USART_INT" name="RXERRCNT" offset="0x20" rw="R" access="RSYNC" size="1" initval="0x00" caption="USART_INT Receive Error Count">
          <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
        </register>
        <register modes="I2CS" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="I2CS Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
        </register>
        <register modes="SPIM" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="SPIM Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
        </register>
        <register modes="SPIS" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="SPIS Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
        </register>
        <register modes="USART_EXT" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="USART_EXT Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x300" values="SERCOM_USART_LENGTH__LENEN"/>
        </register>
        <register modes="USART_INT" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="USART_INT Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x300" values="SERCOM_USART_LENGTH__LENEN"/>
        </register>
        <register modes="I2CM" name="ADDR" offset="0x24" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0x7FF"/>
          <bitfield name="LENEN" caption="Length Enable" mask="0x2000"/>
          <bitfield name="HS" caption="High Speed Mode" mask="0x4000"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="LEN" caption="Length" mask="0xFF0000"/>
        </register>
        <register modes="I2CS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <bitfield name="GENCEN" caption="General Call Address Enable" mask="0x1"/>
          <bitfield name="ADDR" caption="Address Value" mask="0x7FE"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0x7FE0000"/>
        </register>
        <register modes="SPIM" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="SPIS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIS Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="I2CM" name="DATA" offset="0x28" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="I2CM Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="I2CS" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="I2CS Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="SPIM" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIM Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
