Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM2532LS00064.atdf
      <value-group name="SUPC_VREG__SEL">
        <value name="LDO" caption="LDO selection" value="0x0"/>
        <value name="BUCK" caption="Buck selection" value="0x1"/>
      </value-group>
      <value-group name="SUPC_VREF__SEL">
        <value name="2V4" caption="2.4V voltage reference typical value" value="0x6"/>
        <value name="2V5" caption="2.5V voltage reference typical value" value="0x7"/>
      </value-group>
    </module>
    <module name="SysTick" version="1.0.0" caption="SysTick Timer">
      <register-group name="SysTick" caption="SysTick Timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick enable" mask="0x1"/>
          <bitfield name="TICKINT" caption="Tick interrupt" mask="0x2"/>
          <bitfield name="CLKSOURCE" caption="Clock source" mask="0x4"/>
          <bitfield name="COUNTFLAG" caption="Count flag" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Counter reload value" mask="0x1000000"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current counter value" mask="0x1000000"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Ten milliseconds" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="Skew" mask="0x40000000"/>
          <bitfield name="NOREF" caption="No reference" mask="0x80000000"/>
        </register>
      </register-group>
    </module>
    <module name="TC" id="03609" version="3.c.0" caption="Basic Timer Counter">
      <register-group name="TC" caption="Basic Timer Counter">
        <mode name="COUNT8" qualifier="TC.CTRLA.MODE" value="1" caption="8-bit Counter Mode"/>
        <mode name="COUNT16" qualifier="TC.CTRLA.MODE" value="0" caption="16-bit Counter Mode"/>
        <mode name="COUNT32" qualifier="TC.CTRLA.MODE" value="2" caption="32-bit Counter Mode"/>
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="EVACT" caption="Event Action" mask="0x7" values="TC_EVCTRL__EVACT"/>
          <bitfield name="TCINV" caption="TC Event Input Polarity" mask="0x10"/>
          <bitfield name="TCEI" caption="TC Event Enable" mask="0x20"/>
          <bitfield name="OVFEO" caption="Event Output Enable" mask="0x100"/>
          <bitfield name="MCEO0" caption="MC Event Output Enable 0" mask="0x1000"/>
          <bitfield name="MCEO1" caption="MC Event Output Enable 1" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="OVF Interrupt Disable" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Disable" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Disable 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Disable 1" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="OVF Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Enable" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Enable 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Enable 1" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="OVF Interrupt Flag" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Flag" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Flag 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Flag 1" mask="0x20"/>
        </register>
